zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_gptim.h
 /**    
  *******************************************************************************************************
  * @file    fm33fg0xxa_fl_gptim.h
  * @author  FMSH Application Team
  * @brief   Head file of GPTIM FL Module
  *******************************************************************************************************
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33FG0xxA    
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FG0XXA_FL_GPTIM_H
#define __FM33FG0XXA_FL_GPTIM_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fg0xxa_fl_def.h"
/** @addtogroup FM33FG0XXA_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup GPTIM_FL_ES_INIT GPTIM Exported Init structures
  * @{
  */

/**
  * @brief FL GPTIM Init Sturcture definition
  */
typedef struct
{
    /*! 预分频系数 */
    uint32_t prescaler;
    /*! 计数模式 */
    uint32_t counterMode;
    /*! 自动重装载值 */
    uint32_t autoReload;
    /*! 预装载使能 */
    uint32_t autoReloadState;
    /*!定时器分频系数与数字滤波器所使用的采样时钟分频比*/
    uint32_t clockDivision;

} FL_GPTIM_InitTypeDef;

/**
  * @brief GTIM SlaveMode Init Sturcture definition
  */
typedef struct
{
    /*! ITRx 源*/
    uint32_t ITRSourceGroup;
    /*! 外部时钟源模式 */
    uint32_t slaveMode;
    /*! 输入触发信号选择 */
    uint32_t triggerSrc;
    /*! Trigger 延迟*/
    uint32_t triggerDelay;

} FL_GPTIM_SlaveInitTypeDef;
/**
  * @brief  TIM Input Capture configuration structure definition.
  */

typedef struct
{
    /*! 输入捕获使能 */
    uint32_t captureState;
    /*! 输入捕获极性 */
    uint32_t ICPolarity;
    /*! 通道映射激活的输入选择 */
    uint32_t ICActiveInput;
    /*! 输入分频 */
    uint32_t ICPrescaler;
    /*! 输入滤波 */
    uint32_t ICFilter;

} FL_GPTIM_IC_InitTypeDef;
/**
  * @brief  TIM ETR  configuration structure definition.
  */

typedef struct
{
    /*! 外部触发使能 */
    uint32_t useExternalTrigger;
    /*! 外部时钟滤波 */
    uint32_t ETRFilter;
    /*! 外部时钟分频 */
    uint32_t ETRClockDivision;
    /*! 外部时钟触发极性 */
    uint32_t ETRPolarity;

} FL_GPTIM_ETR_InitTypeDef;


/**
  * @brief  TIM Output Compare configuration structure definition.
  */
typedef struct
{
    /*! 比较输出模式 */
    uint32_t OCMode;
    /*! 比较输出通道快速模式使能 */
    uint32_t OCFastMode;
    /*! 输出比较预装载 */
    uint32_t OCPreload;
    /*! 通道比较值 */
    uint32_t CompareValue;
    /*! 比较输出极性 */
    uint32_t OCPolarity;
    /*! ETR清0使能 */
    uint32_t OCETRFStatus;

} FL_GPTIM_OC_InitTypeDef;

/**
  * @}
  */

/**
  * GPTIM0~GPTIM2 ITRSEL_Group 映射表
  *
  * ===================== GPTIM0 ======================
  * ---------------------------------------------------
  * ITRx   | Group  | Function Name | Function Type
  * ---------------------------------------------------
  * ITR0   | 0      | ATIM_TRGO     | 计数触发
  *        | 1      | UART0_RX      | 宽度捕捉
  *        | 2      | UART1_RX      | 宽度捕捉
  *        | 3      | UART3_RX      | 宽度捕捉
  * ---------------------------------------------------
  * ITR1   | 0      | GPTIM2_TRGO   | 计数触发
  *        | 1      | XTHF          | 周期捕捉
  *        | 2      | RCHF          | 周期捕捉
  *        | 3      | LPUART1_RX    | 周期捕捉
  * ---------------------------------------------------
  * ITR2   | 0      | BSTIM32_TRGO  | 计数触发
  *        | 1      | LPUART2_RX    | 宽度捕捉
  *        | 2      | RCLP          | 周期捕捉
  *        | 3      | XTLF          | 周期捕捉
  * ---------------------------------------------------
  * ITR3   | 0      | COMP1_TRGO    | 计数触发
  *        | 1      | RCLF          | 周期捕捉
  *        | 2      | COMP2_TRGO    | 计数触发
  *        | 3      | LPT32_TRGO    | 计数触发
  * ---------------------------------------------------
  *
  * ===================== GPTIM1 ======================
  * ---------------------------------------------------
  * ITRx   | Group  | Function Name | Function Type
  * ---------------------------------------------------
  * ITR0   | 0      | ATIM_TRGO     | 计数触发
  *        | 1      | UART0_RX      | 宽度捕捉
  *        | 2      | UART1_RX      | 宽度捕捉
  *        | 3      | UART3_RX      | 宽度捕捉
  * ---------------------------------------------------
  * ITR1   | 0      | GPTIM0_TRGO   | 计数触发
  *        | 1      | LUT1_TRGO     | 周期捕捉
  *        | 2      | RCHF          | 周期捕捉
  *        | 3      | ADC_EOC_TRGO  | 计数触发
  * ---------------------------------------------------
  * ITR2   | 0      | BSTIM32_TRGO  | 计数触发
  *        | 1      | LSCLK         | 周期捕捉
  *        | 2      | RCLP          | 周期捕捉
  *        | 3      | XTLF          | 周期捕捉
  * ---------------------------------------------------
  * ITR3   | 0      | COMP1_TRGO    | 计数触发
  *        | 1      | LUT3_TRGO     | 周期捕捉
  *        | 2      | COMP2_TRGO    | 计数触发
  *        | 3      | LPT32_TRGO    | 计数触发
  * ---------------------------------------------------
  *
  * ===================== GPTIM2 ======================
  * ---------------------------------------------------
  * ITRx   | Group  | Function Name | Function Type
  * ---------------------------------------------------
  * ITR0   | 0      | ATIM_TRGO     | 计数触发
  *        | 1      | UART3_RX      | 宽度捕捉
  *        | 2      | UART4_RX      | 宽度捕捉
  *        | 3      | LUT0_TRGO     | 宽度捕捉
  * ---------------------------------------------------
  * ITR1   | 0      | GPTIM1_TRGO   | 计数触发
  *        | 1      | XTHF          | 周期捕捉
  *        | 2      | RCHF          | 周期捕捉
  *        | 3      | ADC_EOC_TRGO  | 计数触发
  * ---------------------------------------------------
  * ITR2   | 0      | BSTIM16_TRGO  | 计数触发
  *        | 1      | LSCLK         | 周期捕捉
  *        | 2      | RCLP          | 周期捕捉
  *        | 3      | XTLF          | 周期捕捉
  * ---------------------------------------------------
  * ITR3   | 0      | COMP1_TRGO    | 计数触发
  *        | 1      | LUT2_TRGO     | 周期捕捉
  *        | 2      | COMP2_TRGO    | 计数触发
  *        | 3      | LPT16_TRGO    | 计数触发
  * ---------------------------------------------------
  *
  */

/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup GPTIM_FL_Exported_Constants GPTIM Exported Constants
  * @{
  */

#define    GPTIM_CR1_CKD_Pos                                      (8U)
#define    GPTIM_CR1_CKD_Msk                                      (0x3U << GPTIM_CR1_CKD_Pos)
#define    GPTIM_CR1_CKD                                          GPTIM_CR1_CKD_Msk

#define    GPTIM_CR1_ARPE_Pos                                     (7U)
#define    GPTIM_CR1_ARPE_Msk                                     (0x1U << GPTIM_CR1_ARPE_Pos)
#define    GPTIM_CR1_ARPE                                         GPTIM_CR1_ARPE_Msk

#define    GPTIM_CR1_CMS_Pos                                      (5U)
#define    GPTIM_CR1_CMS_Msk                                      (0x3U << GPTIM_CR1_CMS_Pos)
#define    GPTIM_CR1_CMS                                          GPTIM_CR1_CMS_Msk

